In [7]:
#pandas series
# a series a basic building blocks of Pandas
# its hold an array of information organized by an index.
import numpy as np 
import pandas as pd

In [72]:
labels=['a','b','c']

In [73]:
mylist=[10,20,30]

In [74]:
arr=np.array(mylist)

In [75]:
arr

array([10, 20, 30])

In [76]:
d = {'a':10,'b':20,'c':30}

In [77]:
pd.Series(data=mylist)

0    10
1    20
2    30
dtype: int64

In [78]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int32

In [79]:
pd.Series(data=[10,'a',4.4])

0     10
1      a
2    4.4
dtype: object

In [80]:
ser1 = pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])

In [81]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [82]:
ser1['USA']

1

In [83]:
ser2=pd.Series([1,4,5,6],index=['USA','Germany','Italy','Japan'])

In [84]:
ser2

USA        1
Germany    4
Italy      5
Japan      6
dtype: int64

In [85]:
ser1 +ser2

Germany     6.0
Italy       NaN
Japan      10.0
USA         2.0
USSR        NaN
dtype: float64

In [86]:
#Dataframe part One
#Dataframe
# the Dataframe is simply multiple series that share the same index
#it is essentially a tabular data storage format.(csv ,excel)
# a Dataframe has multiple columns

In [87]:
import pandas as pd
import numpy as np

In [88]:
from numpy.random import randn
np.random.seed(101)

rand_mat =randn(5,4)

In [89]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [90]:
df=pd.DataFrame(data=rand_mat, index='A B C D E'.split(), columns='W X Y Z'.split())

In [91]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [92]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [93]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [94]:
type(df['W'])

pandas.core.series.Series

In [95]:
#mylist=['W','Y']
#df[mylist]
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [96]:
df.W
#not use this method not recommended

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [97]:
df['NEW'] =df['W']+ df['Y']

In [98]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [99]:
df.drop('NEW', axis=1,inplace=True)

In [100]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [101]:
df.drop('C')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [102]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [103]:
df.loc[['A','E']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [104]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [105]:
df.iloc[[0,3]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

In [106]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [107]:
#df.loc[['A','B']][['Y','Z']]
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [108]:
#Dataframe Part 2

In [109]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [110]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [111]:
df_bool =df>0

In [112]:
df[df_bool]
#df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [113]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [114]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [115]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [116]:
df[df['W']>0]['Y'].loc['A']

0.9079694464765431

In [117]:
cond1 = df['W']>0
cond2 =df['Y'] >1

In [118]:
df[(cond1) & (cond2)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [59]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [119]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [120]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [129]:
new_ind ='CA NY WY OR CP'.split()

In [130]:
new_ind

['CA', 'NY', 'WY', 'OR', 'CP']

In [131]:
df['States']=new_ind

In [124]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CP

In [133]:
df.set_index('States',inplace=True)

In [134]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CP      0.190794  1.978757  2.605967  0.683509

In [135]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CP
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [136]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [138]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [139]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CP      0.190794  1.978757  2.605967  0.683509

In [140]:
df['W']>0

States
CA     True
NY     True
WY    False
OR     True
CP     True
Name: W, dtype: bool

In [141]:
ser_w= df['W']>0

In [143]:
ser_w.value_counts()

W
True     4
False    1
Name: count, dtype: int64

In [144]:
sum(ser_w)

4

In [145]:
len(ser_w)

5

In [146]:
# Missiing Data with Pandas

In [148]:
#sometimes data will be missing from your original data source
#yet many forecasting methods can't work with the missing data points
#so what can we do?
'''
 Missing Data has only 3 options:
o Keep the missing data (NaN), if the
forecasting method can handle
o Drop the missing data (the entire
including the timestamp).
o Fill in the missing data with some
value (best estimated guess),
'''

'\n Missing Data has only 3 options:\no Keep the missing data (NaN), if the\nforecasting method can handle\no Drop the missing data (the entire\nincluding the timestamp).\no Fill in the missing data with some\nvalue (best estimated guess),\n'

In [149]:
import pandas as pd
import numpy as np

In [153]:
df =pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})

In [154]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [155]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [156]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [157]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [159]:
#how many non na value using thresh
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [161]:
df.fillna(value='Fill VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill VALUE  2
2  Fill VALUE  Fill VALUE  3

In [162]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [164]:
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [166]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [167]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [169]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [1]:
#group By Operation
#Group By opeartion involve
#split
#Apply
#Combine
#PAndas does all of this with a simple method call:groupby()

In [14]:
import pandas as pd
data ={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Charlie','Amy','Vannessa','Carl','Sarah'],
      'Sales':[200,120,340,124,243,350]}

In [15]:
df=pd.DataFrame(data)

In [22]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Vannessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [30]:
df.groupby('Company').sum()

              Person  Sales
Company
FB         CarlSarah    593
GOOG      SamCharlie    320
MSFT     AmyVannessa    464

In [32]:
df.groupby('Company').mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [33]:
df.groupby('Company').max()

           Person  Sales
Company
FB          Sarah    350
GOOG          Sam    200
MSFT     Vannessa    340

In [37]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [38]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [39]:
#Common Operation

In [51]:
import pandas as pd
df= pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [52]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [53]:
df['col2'].nunique()

3

In [54]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [55]:
#value  col 1>2
#col2 ==444
newdf = df [ (df['col1']>2) & (df['col2']==444)]

In [56]:
newdf

   col1  col2 col3
3     4   444  xyz

In [59]:
def times_two(number):
    return number*2

In [60]:
times_two(4)

8

In [61]:
df['col1'].apply(times_two)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [66]:
df['new']=df['col1'].apply(times_two)

In [67]:
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [64]:
del df['new']

In [65]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [68]:
df.drop(columns='new')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [69]:
df.columns

Index(['col1', 'col2', 'col3', 'new'], dtype='object')

In [70]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
 3   new     4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

In [73]:
df.describe()

           col1        col2       new
count  4.000000    4.000000  4.000000
mean   2.500000  527.250000  5.000000
std    1.290994  106.274409  2.581989
min    1.000000  444.000000  2.000000
25%    1.750000  444.000000  3.500000
50%    2.500000  499.500000  5.000000
75%    3.250000  582.750000  6.500000
max    4.000000  666.000000  8.000000

In [74]:
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [76]:
df.sort_values('col2',ascending=False)

   col1  col2 col3  new
2     3   666  ghi    6
1     2   555  def    4
0     1   444  abc    2
3     4   444  xyz    8

In [77]:
# Data Input And Output

In [78]:
# pandas can read a variety of tabular data formats.
# keep in mind , for this course , we will  provide all the data for you 
# in Csv files

In [2]:
import pandas as pd

In [80]:
pwd

'C:\\Users\\SHRI\\Desktop\\Udemy TSA'

In [82]:
df=pd.read_csv('example.csv')

In [83]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [84]:
newdf =df[['a','b']]

In [85]:
newdf

    a   b
0   0   1
1   4   5
2   8   9
3  12  13

In [87]:
newdf.to_csv('mynew.csv', index=False)

In [88]:
df=pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

In [89]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [90]:
df.columns

Index(['Unnamed: 0', 'a', 'b', 'c', 'd'], dtype='object')

In [91]:
df.drop('Unnamed: 0',axis=1)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
mylist_of_tables = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [9]:
mylist_of_tables

[                         Bank NameBank       CityCity StateSt  CertCert  \
 0             Heartland Tri-State Bank        Elkhart      KS     25851
 1                  First Republic Bank  San Francisco      CA     59017
 2                       Signature Bank       New York      NY     57053
 3                  Silicon Valley Bank    Santa Clara      CA     24735
 4                    Almena State Bank         Almena      KS     15426
 ..                                 ...            ...     ...       ...
 562                 Superior Bank, FSB       Hinsdale      IL     32646
 563                Malta National Bank          Malta      OH      6629
 564    First Alliance Bank & Trust Co.     Manchester      NH     34264
 565  National State Bank of Metropolis     Metropolis      IL      3815
 566                   Bank of Honolulu       Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                 Dream First Bank, N.A.       July 28, 2023     10544
 1              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
 2                    Flagstar Bank, N.A.      March 12, 2023     10540
 3    FirstCitizens Bank & Trust Company      March 10, 2023     10539
 4                            Equity Bank    October 23, 2020     10538
 ..                                   ...                 ...       ...
 562                Superior Federal, FSB       July 27, 2001      6004
 563                    North Valley Bank         May 3, 2001      4648
 564  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 565              Banterra Bank of Marion   December 14, 2000      4646
 566                   Bank of the Orient    October 13, 2000      4645

 [567 rows x 7 columns]]

In [10]:
type(mylist_of_tables)

list

In [11]:
len(mylist_of_tables)

1

In [12]:
df=mylist_of_tables[0]

In [13]:
df

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
1,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
2,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
3,Silicon Valley Bank,Santa Clara,CA,24735,FirstCitizens Bank & Trust Company,"March 10, 2023",10539
4,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
...,...,...,...,...,...,...,...
562,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
563,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
564,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
565,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
566,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645